bmourit/ArduinoCore-GD32/boards.txt
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.build.variant=GD32F170C4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC=GD32F170C6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.build.board=GD32F170C6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.build.variant=GD32F170C6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F170C8_GENERIC=GD32F170C8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F170C8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F170C8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F170C8_GENERIC.build.board=GD32F170C8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170C8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F170C8_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F170C8_GENERIC.build.variant=GD32F170C8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170C8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F170R8_GENERIC=GD32F170R8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F170R8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F170R8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F170R8_GENERIC.build.board=GD32F170R8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170R8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F170R8_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F170R8_GENERIC.build.variant=GD32F170R8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170R8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F170T4_GENERIC=GD32F170T4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F170T4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F170T4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F170T4_GENERIC.build.board=GD32F170T4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170T4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F170T4_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F170T4_GENERIC.build.variant=GD32F170T4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170T4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F170T6_GENERIC=GD32F170T6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F170T6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F170T6_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F170T6_GENERIC.build.board=GD32F170T6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170T6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F170T6_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F170T6_GENERIC.build.variant=GD32F170T6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170T6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F170T8_GENERIC=GD32F170T8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F170T8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F170T8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F170T8_GENERIC.build.board=GD32F170T8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170T8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F170T8_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F170T8_GENERIC.build.variant=GD32F170T8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170T8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F190C4_GENERIC=GD32F190C4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F190C4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F190C4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F190C4_GENERIC.build.board=GD32F190C4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190C4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F190C4_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F190C4_GENERIC.build.variant=GD32F190C4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190C4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F190C6_GENERIC=GD32F190C6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F190C6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F190C6_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f1x0.menu.pnum.GD32F190C6_GENERIC.build.board=GD32F190C6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190C6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F190C6_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F190C6_GENERIC.build.variant=GD32F190C6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190C6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F190C8_GENERIC=GD32F190C8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F190C8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F190C8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F190C8_GENERIC.build.board=GD32F190C8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190C8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F190C8_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F190C8_GENERIC.build.variant=GD32F190C8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190C8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F190R4_GENERIC=GD32F190R4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F190R4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F190R4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F190R4_GENERIC.build.board=GD32F190R4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190R4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F190R4_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F190R4_GENERIC.build.variant=GD32F190R4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190R4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F190R6_GENERIC=GD32F190R6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F190R6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F190R6_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f1x0.menu.pnum.GD32F190R6_GENERIC.build.board=GD32F190R6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190R6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F190R6_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F190R6_GENERIC.build.variant=GD32F190R6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190R6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F190R8_GENERIC=GD32F190R8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F190R8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F190R8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F190R8_GENERIC.build.board=GD32F190R8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190R8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F190R8_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F190R8_GENERIC.build.variant=GD32F190R8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190R8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F190T4_GENERIC=GD32F190T4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F190T4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F190T4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F190T4_GENERIC.build.board=GD32F190T4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190T4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F190T4_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F190T4_GENERIC.build.variant=GD32F190T4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190T4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F190T6_GENERIC=GD32F190T6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F190T6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F190T6_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f1x0.menu.pnum.GD32F190T6_GENERIC.build.board=GD32F190T6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190T6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F190T6_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F190T6_GENERIC.build.variant=GD32F190T6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190T6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F190T8_GENERIC=GD32F190T8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F190T8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F190T8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F190T8_GENERIC.build.board=GD32F190T8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190T8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F190T8_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F190T8_GENERIC.build.variant=GD32F190T8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F190T8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.usb.off=Off

# Upload menu
gd_generic_gd32f1x0.menu.upload_method.serialMethod=gd32flash (Serial)
gd_generic_gd32f1x0.menu.upload_method.serialMethod.upload.protocol=maple_serial
gd_generic_gd32f1x0.menu.upload_method.serialMethod.upload.options=
gd_generic_gd32f1x0.menu.upload_method.serialMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1
gd_generic_gd32f1x0.menu.upload_method.serialMethod.upload.tool=serial_upload

gd_generic_gd32f1x0.menu.upload_method.gdlinkMethod=GDlink (SWD)
gd_generic_gd32f1x0.menu.upload_method.gdlinkMethod.upload.protocol=gdlink
gd_generic_gd32f1x0.menu.upload_method.gdlinkMethod.upload.options=
gd_generic_gd32f1x0.menu.upload_method.gdlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
gd_generic_gd32f1x0.menu.upload_method.gdlinkMethod.upload.tool=gdlink_upload

gd_generic_gd32f1x0.menu.upload_method.stlinkMethod=STLink (SWD)
gd_generic_gd32f1x0.menu.upload_method.stlinkMethod.upload.protocol=stlink
gd_generic_gd32f1x0.menu.upload_method.stlinkMethod.upload.options=
gd_generic_gd32f1x0.menu.upload_method.stlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
gd_generic_gd32f1x0.menu.upload_method.stlinkMethod.upload.tool=stlink_upload

gd_generic_gd32f1x0.menu.upload_method.jlinkMethod=JLink (SWD)
gd_generic_gd32f1x0.menu.upload_method.jlinkMethod.upload.protocol=jlink
gd_generic_gd32f1x0.menu.upload_method.jlinkMethod.upload.options=
gd_generic_gd32f1x0.menu.upload_method.jlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
gd_generic_gd32f1x0.menu.upload_method.jlinkMethod.upload.tool=jlink_upload

gd_generic_gd32f1x0.menu.upload_method.dfuUtilMethod=dfu-util (DFU - STMDuino bootloader)
gd_generic_gd32f1x0.menu.upload_method.dfuUtilMethod.upload.protocol=dfu
gd_generic_gd32f1x0.menu.upload_method.dfuUtilMethod.upload.options=
gd_generic_gd32f1x0.menu.upload_method.dfuUtilMethod.build.upload_flags=
gd_generic_gd32f1x0.menu.upload_method.dfuUtilMethod.upload.tool=dfu-util

gd_generic_gd32f1x0.menu.upload_method.dfuUtilMethod.build.flash_offset=0x2000
gd_generic_gd32f1x0.menu.upload_method.dfuUtilMethod.upload.pid=0x004
gd_generic_gd32f1x0.menu.upload_method.dfuUtilMethod.upload.vid=0x1209

