bmourit/ArduinoCore-GD32/boards.txt
# Optimizations
gd_generic_gd32f1x0.menu.opt.osstd=Smallest (default)
gd_generic_gd32f1x0.menu.opt.o1std=Fast (-O1)
gd_generic_gd32f1x0.menu.opt.o1std.build.flags.optimize=-O1
gd_generic_gd32f1x0.menu.opt.o1std.build.flags.ldspecs=
gd_generic_gd32f1x0.menu.opt.o2std=Faster (-O2)
gd_generic_gd32f1x0.menu.opt.o2std.build.flags.optimize=-O2
gd_generic_gd32f1x0.menu.opt.o2std.build.flags.ldspecs=
gd_generic_gd32f1x0.menu.opt.o3std=Fastest (-O3)
gd_generic_gd32f1x0.menu.opt.o3std.build.flags.optimize=-O3
gd_generic_gd32f1x0.menu.opt.o3std.build.flags.ldspecs=
gd_generic_gd32f1x0.menu.opt.ogstd=Debug (-Og)
gd_generic_gd32f1x0.menu.opt.ogstd.build.flags.optimize=-Og
gd_generic_gd32f1x0.menu.opt.ogstd.build.flags.ldspecs=

##################################################
# Creality GD32F30x
gd_creality_gd32f30x.name=Creality GD32F303R series
gd_creality_gd32f30x.build.core=arduino
gd_creality_gd32f30x.build.board=gd_creality_gd32f30x
gd_creality_gd32f30x.build.mcu=cortex-m4
gd_creality_gd32f30x.build.series=GD32F30x

gd_creality_gd32f30x.build.vid=0xdead
gd_creality_gd32f30x.build.pid=0xbeef
gd_creality_gd32f30x.build.usb_product="USB Test"
gd_creality_gd32f30x.build.usb_manufacturer="Arduino"

# create a new entry for each board here

# Creality GD32F303RE
gd_creality_gd32f30x.menu.pnum.CREALITY_422_GD32F303RE=Creality GD32F303RE
gd_creality_gd32f30x.menu.pnum.CREALITY_422_GD32F303RE.upload.maximum_size=524288
gd_creality_gd32f30x.menu.pnum.CREALITY_422_GD32F303RE.upload.maximum_data_size=65536
gd_creality_gd32f30x.menu.pnum.CREALITY_422_GD32F303RE.build.board=CREALITY_422_GD32F303RE
gd_creality_gd32f30x.menu.pnum.CREALITY_422_GD32F303RE.build.series=GD32F30x
gd_creality_gd32f30x.menu.pnum.CREALITY_422_GD32F303RE.build.product_line=GD32F30X_HD
gd_creality_gd32f30x.menu.pnum.CREALITY_422_GD32F303RE.build.variant=CREALITY_422_GD32F303RE
gd_creality_gd32f30x.menu.pnum.CREALITY_422_GD32F303RE.upload.openocd_script=target/stm32f1x.cfg

# USB
gd_creality_gd32f30x.menu.usb.off=Off
gd_creality_gd32f30x.menu.usb.on=On
gd_creality_gd32f30x.menu.usb.on.build.enable_usb={build.usb_flags} -DUSBCON -DUSBD_USE_CDC

# Upload menu
gd_creality_gd32f30x.menu.upload_method.serialMethod=gd32flash (Serial)
gd_creality_gd32f30x.menu.upload_method.serialMethod.upload.protocol=maple_serial
gd_creality_gd32f30x.menu.upload_method.serialMethod.upload.options=
gd_creality_gd32f30x.menu.upload_method.serialMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1
gd_creality_gd32f30x.menu.upload_method.serialMethod.upload.tool=serial_upload

gd_creality_gd32f30x.menu.upload_method.gdlinkMethod=GDlink (SWD)
gd_creality_gd32f30x.menu.upload_method.gdlinkMethod.upload.protocol=gdlink
gd_creality_gd32f30x.menu.upload_method.gdlinkMethod.upload.options=
gd_creality_gd32f30x.menu.upload_method.gdlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
gd_creality_gd32f30x.menu.upload_method.gdlinkMethod.upload.tool=gdlink_upload

gd_creality_gd32f30x.menu.upload_method.stlinkMethod=STLink (SWD)
gd_creality_gd32f30x.menu.upload_method.stlinkMethod.upload.protocol=stlink
gd_creality_gd32f30x.menu.upload_method.stlinkMethod.upload.options=
gd_creality_gd32f30x.menu.upload_method.stlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
gd_creality_gd32f30x.menu.upload_method.stlinkMethod.upload.tool=stlink_upload

gd_creality_gd32f30x.menu.upload_method.jlinkMethod=JLink (SWD)
gd_creality_gd32f30x.menu.upload_method.jlinkMethod.upload.protocol=jlink
gd_creality_gd32f30x.menu.upload_method.jlinkMethod.upload.options=
gd_creality_gd32f30x.menu.upload_method.jlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
gd_creality_gd32f30x.menu.upload_method.jlinkMethod.upload.tool=jlink_upload

gd_creality_gd32f30x.menu.upload_method.dfuUtilMethod=dfu-util (DFU - STMDuino bootloader)
gd_creality_gd32f30x.menu.upload_method.dfuUtilMethod.upload.protocol=dfu
gd_creality_gd32f30x.menu.upload_method.dfuUtilMethod.upload.options=
gd_creality_gd32f30x.menu.upload_method.dfuUtilMethod.build.upload_flags=
gd_creality_gd32f30x.menu.upload_method.dfuUtilMethod.upload.tool=dfu-util

gd_creality_gd32f30x.menu.upload_method.dfuUtilMethod.build.flash_offset=0x2000
gd_creality_gd32f30x.menu.upload_method.dfuUtilMethod.upload.pid=0x004
gd_creality_gd32f30x.menu.upload_method.dfuUtilMethod.upload.vid=0x1209

# Optimizations
gd_creality_gd32f30x.menu.opt.osstd=Smallest (-Os default)
gd_creality_gd32f30x.menu.opt.o1std=Fast (-O1)
gd_creality_gd32f30x.menu.opt.o1std.build.flags.optimize=-O1
gd_creality_gd32f30x.menu.opt.o1std.build.flags.ldspecs=
gd_creality_gd32f30x.menu.opt.o2std=Faster (-O2)
gd_creality_gd32f30x.menu.opt.o2std.build.flags.optimize=-O2
gd_creality_gd32f30x.menu.opt.o2std.build.flags.ldspecs=
gd_creality_gd32f30x.menu.opt.o3std=Fastest (-O3)
gd_creality_gd32f30x.menu.opt.o3std.build.flags.optimize=-O3
gd_creality_gd32f30x.menu.opt.o3std.build.flags.ldspecs=
gd_creality_gd32f30x.menu.opt.ogstd=Debug (-Og)
gd_creality_gd32f30x.menu.opt.ogstd.build.flags.optimize=-Og
gd_creality_gd32f30x.menu.opt.ogstd.build.flags.ldspecs=
gd_creality_gd32f30x.menu.opt.ogstd=No Optimization (-O0)
gd_creality_gd32f30x.menu.opt.ogstd.build.flags.optimize=-O0
gd_creality_gd32f30x.menu.opt.ogstd.build.flags.ldspecs=


##################################################
# Generic GD32F30x
gd_generic_gd32f30x.name=GD32F30x Generic series
gd_generic_gd32f30x.build.core=arduino
gd_generic_gd32f30x.build.board=gd_generic_gd32f30x
gd_generic_gd32f30x.build.mcu=cortex-m4
gd_generic_gd32f30x.build.series=GD32F30x

gd_generic_gd32f30x.build.vid=0xdead
gd_generic_gd32f30x.build.pid=0xbeef
gd_generic_gd32f30x.build.usb_product="USB Test"
gd_generic_gd32f30x.build.usb_manufacturer="Arduino"

# create a new entry each board here

# Generic GD32F303CC
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC=GD32F303CC (Generic)
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.upload.maximum_size=262144
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.upload.maximum_data_size=49152
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.build.board=GD32F303CC_GENERIC
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.build.series=GD32F30x
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.build.product_line=GD32F30X_HD
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.build.variant=GD32F303CC_GENERIC
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.upload.openocd_script=target/stm32f1x.cfg

# Generic GD32F303RE
gd_generic_gd32f30x.menu.pnum.GD32F303RE_GENERIC=GD32F303RE (Generic)
gd_generic_gd32f30x.menu.pnum.GD32F303RE_GENERIC.upload.maximum_size=524288
gd_generic_gd32f30x.menu.pnum.GD32F303RE_GENERIC.upload.maximum_data_size=65536
gd_generic_gd32f30x.menu.pnum.GD32F303RE_GENERIC.build.board=GD32F303RE_GENERIC
gd_generic_gd32f30x.menu.pnum.GD32F303RE_GENERIC.build.series=GD32F30x
gd_generic_gd32f30x.menu.pnum.GD32F303RE_GENERIC.build.product_line=GD32F30X_HD
gd_generic_gd32f30x.menu.pnum.GD32F303RE_GENERIC.build.variant=GD32F303RE_GENERIC
gd_generic_gd32f30x.menu.pnum.GD32F303RE_GENERIC.upload.openocd_script=target/stm32f1x.cfg

# Generic GD32F303ZE
gd_generic_gd32f30x.menu.pnum.GD32F303ZE_GENERIC=GD32F303ZE (Generic)
gd_generic_gd32f30x.menu.pnum.GD32F303ZE_GENERIC.upload.maximum_size=524288
gd_generic_gd32f30x.menu.pnum.GD32F303ZE_GENERIC.upload.maximum_data_size=65536
gd_generic_gd32f30x.menu.pnum.GD32F303ZE_GENERIC.build.board=GD32F303ZE_GENERIC
gd_generic_gd32f30x.menu.pnum.GD32F303ZE_GENERIC.build.series=GD32F30x
gd_generic_gd32f30x.menu.pnum.GD32F303ZE_GENERIC.build.product_line=GD32F30X_HD
gd_generic_gd32f30x.menu.pnum.GD32F303ZE_GENERIC.build.variant=GD32F303ZE_GENERIC
gd_generic_gd32f30x.menu.pnum.GD32F303ZE_GENERIC.upload.openocd_script=target/stm32f1x.cfg

# USB
gd_generic_gd32f30x.menu.usb.off=Off
gd_generic_gd32f30x.menu.usb.on=On
gd_generic_gd32f30x.menu.usb.on.build.enable_usb={build.usb_flags} -DUSBCON -DUSBD_USE_CDC

# Upload menu
gd_generic_gd32f30x.menu.upload_method.serialMethod=gd32flash (Serial)
gd_generic_gd32f30x.menu.upload_method.serialMethod.upload.protocol=maple_serial
gd_generic_gd32f30x.menu.upload_method.serialMethod.upload.options=
gd_generic_gd32f30x.menu.upload_method.serialMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1
gd_generic_gd32f30x.menu.upload_method.serialMethod.upload.tool=serial_upload

