bmourit/ArduinoCore-GD32/boards.txt
gd_generic_gd32f10x.menu.pnum.GD32F103VE_GENERIC.upload.maximum_data_size=65536
gd_generic_gd32f10x.menu.pnum.GD32F103VE_GENERIC.build.board=GD32F103VE_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VE_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103VE_GENERIC.build.product_line=GD32F10X_HD
gd_generic_gd32f10x.menu.pnum.GD32F103VE_GENERIC.build.variant=GD32F103VE_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VE_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103VF_GENERIC=GD32F103VF (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103VF_GENERIC.upload.maximum_size=786432
gd_generic_gd32f10x.menu.pnum.GD32F103VF_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103VF_GENERIC.build.board=GD32F103VF_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VF_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103VF_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103VF_GENERIC.build.variant=GD32F103VF_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VF_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103VG_GENERIC=GD32F103VG (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103VG_GENERIC.upload.maximum_size=1048576
gd_generic_gd32f10x.menu.pnum.GD32F103VG_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103VG_GENERIC.build.board=GD32F103VG_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VG_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103VG_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103VG_GENERIC.build.variant=GD32F103VG_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VG_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103VI_GENERIC=GD32F103VI (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103VI_GENERIC.upload.maximum_size=2097152
gd_generic_gd32f10x.menu.pnum.GD32F103VI_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103VI_GENERIC.build.board=GD32F103VI_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VI_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103VI_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103VI_GENERIC.build.variant=GD32F103VI_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VI_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103VK_GENERIC=GD32F103VK (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103VK_GENERIC.upload.maximum_size=3145728
gd_generic_gd32f10x.menu.pnum.GD32F103VK_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103VK_GENERIC.build.board=GD32F103VK_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VK_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103VK_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103VK_GENERIC.build.variant=GD32F103VK_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103VK_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103ZC_GENERIC=GD32F103ZC (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103ZC_GENERIC.upload.maximum_size=262144
gd_generic_gd32f10x.menu.pnum.GD32F103ZC_GENERIC.upload.maximum_data_size=49152
gd_generic_gd32f10x.menu.pnum.GD32F103ZC_GENERIC.build.board=GD32F103ZC_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZC_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103ZC_GENERIC.build.product_line=GD32F10X_HD
gd_generic_gd32f10x.menu.pnum.GD32F103ZC_GENERIC.build.variant=GD32F103ZC_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZC_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103ZD_GENERIC=GD32F103ZD (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103ZD_GENERIC.upload.maximum_size=393216
gd_generic_gd32f10x.menu.pnum.GD32F103ZD_GENERIC.upload.maximum_data_size=65536
gd_generic_gd32f10x.menu.pnum.GD32F103ZD_GENERIC.build.board=GD32F103ZD_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZD_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103ZD_GENERIC.build.product_line=GD32F10X_HD
gd_generic_gd32f10x.menu.pnum.GD32F103ZD_GENERIC.build.variant=GD32F103ZD_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZD_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103ZE_GENERIC=GD32F103ZE (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103ZE_GENERIC.upload.maximum_size=524288
gd_generic_gd32f10x.menu.pnum.GD32F103ZE_GENERIC.upload.maximum_data_size=65536
gd_generic_gd32f10x.menu.pnum.GD32F103ZE_GENERIC.build.board=GD32F103ZE_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZE_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103ZE_GENERIC.build.product_line=GD32F10X_HD
gd_generic_gd32f10x.menu.pnum.GD32F103ZE_GENERIC.build.variant=GD32F103ZE_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZE_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103ZF_GENERIC=GD32F103ZF (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103ZF_GENERIC.upload.maximum_size=786432
gd_generic_gd32f10x.menu.pnum.GD32F103ZF_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103ZF_GENERIC.build.board=GD32F103ZF_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZF_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103ZF_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103ZF_GENERIC.build.variant=GD32F103ZF_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZF_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103ZG_GENERIC=GD32F103ZG (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103ZG_GENERIC.upload.maximum_size=1048576
gd_generic_gd32f10x.menu.pnum.GD32F103ZG_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103ZG_GENERIC.build.board=GD32F103ZG_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZG_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103ZG_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103ZG_GENERIC.build.variant=GD32F103ZG_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZG_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103ZI_GENERIC=GD32F103ZI (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103ZI_GENERIC.upload.maximum_size=2097152
gd_generic_gd32f10x.menu.pnum.GD32F103ZI_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103ZI_GENERIC.build.board=GD32F103ZI_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZI_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103ZI_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103ZI_GENERIC.build.variant=GD32F103ZI_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZI_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103ZK_GENERIC=GD32F103ZK (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103ZK_GENERIC.upload.maximum_size=3145728
gd_generic_gd32f10x.menu.pnum.GD32F103ZK_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103ZK_GENERIC.build.board=GD32F103ZK_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZK_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103ZK_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103ZK_GENERIC.build.variant=GD32F103ZK_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103ZK_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.usb.off=Off

# Upload menu
gd_generic_gd32f10x.menu.upload_method.serialMethod=gd32flash (Serial)
gd_generic_gd32f10x.menu.upload_method.serialMethod.upload.protocol=maple_serial
gd_generic_gd32f10x.menu.upload_method.serialMethod.upload.options=
gd_generic_gd32f10x.menu.upload_method.serialMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1
gd_generic_gd32f10x.menu.upload_method.serialMethod.upload.tool=serial_upload

